zephyrproject-rtos/hal_nxp/dts/nxp/s32/pinctrl/S32K396_176LQFP_EP-pinctrl.h
/*
 * Copyright 2026 NXP
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on S32K396_289BGA-pinctrl.h with this part's differences applied
 * below (619 removed, 0 changed,
 * 19 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 58d98eef4b28e57c
 */

#ifndef _ZEPHYR_DTS_BINDING_S32K396_176LQFP_EP_WRAPPER_
#define _ZEPHYR_DTS_BINDING_S32K396_176LQFP_EP_WRAPPER_

#include "S32K396_289BGA-pinctrl.h"

/* Signals not present on this part */
#undef PTA0_EIRQ0
#undef PTA0_EMIOS_0_CH17_Z
#undef PTA0_FXIO_D2
#undef PTA0_LPSPI0_PCS7
#undef PTA0_LPSPI4_PCS2
#undef PTA0_LPUART0_CTS
#undef PTA14_EIRQ22
#undef PTA14_ETPU_A_CH6_I
#undef PTA14_ETPU_A_CH6_O
#undef PTA14_ETPU_B_CH9_I
#undef PTA14_ETPU_B_CH9_O
#undef PTA14_FXIO_D14_I
#undef PTA14_FXIO_D14_O
#undef PTA14_LPSPI1_PCS3_I
#undef PTA14_LPSPI1_PCS3_O
#undef PTA14_LPSPI5_PCS1_I
#undef PTA14_LPSPI5_PCS1_O
#undef PTA23_CAN1_TX
#undef PTA23_ETPU_A_CH24_I
#undef PTA23_ETPU_A_CH24_O
#undef PTA23_ETPU_B_CH13_I
#undef PTA23_ETPU_B_CH13_O
#undef PTA23_FXIO_D2_I
#undef PTA23_FXIO_D2_O
#undef PTA23_LCU0_OUT0
#undef PTA23_LPI2C0_SCLS_I
#undef PTA23_LPI2C0_SCLS_O
#undef PTA26_EMAC_PPS0_I
#undef PTA26_EMAC_PPS0_O
#undef PTA26_EMIOS_0_CH9_Z_I
#undef PTA26_EMIOS_0_CH9_Z_O
#undef PTA26_FXIO_D1_I
#undef PTA26_FXIO_D1_O
#undef PTA26_LPSPI0_PCS0_I
#undef PTA26_LPSPI0_PCS0_O
#undef PTA26_LPSPI1_PCS0_I
#undef PTA26_LPSPI1_PCS0_O
#undef PTA26_PGOOD
#undef PTB2_ADC1_MA0
#undef PTB2_CAN4_RX
#undef PTB2_EIRQ10
#undef PTB2_EMIOS_0_CH8_Z_I
#undef PTB2_EMIOS_0_CH8_Z_O
#undef PTB2_FXIO_D18_I
#undef PTB2_FXIO_D18_O
#undef PTB2_LCU1_OUT3
#undef PTB2_LPSPI2_SIN_I
#undef PTB2_LPSPI2_SIN_O
#undef PTB2_LPUART1_RX
#undef PTB2_LPUART_MSC0_RX
#undef PTB2_QUADSPI_INTA
#undef PTB2_TRGMUX_IN3
#undef PTC6_CAN2_RX
#undef PTC6_EIRQ6
#undef PTC6_FXIO_D11
#undef PTC6_LPSPI0_PCS1
#undef PTC6_LPSPI1_PCS1
#undef PTC6_LPUART1_RX
#undef PTC7_EIRQ7
#undef PTC7_FXIO_D10
#undef PTC7_LPI2C0_HREQ
#undef PTC7_LPI2C1_SCL
#undef PTC7_LPSPI0_PCS0
#undef PTD18_CAN2_TX
#undef PTD18_DSPI_MSC0_SCK
#undef PTD18_EMIOS_0_CH15_Z_I
#undef PTD18_EMIOS_0_CH15_Z_O
#undef PTD18_ETPU_A_CH17_I
#undef PTD18_ETPU_A_CH17_O
#undef PTD18_ETPU_B_CH25_I
#undef PTD18_ETPU_B_CH25_O
#undef PTD18_EXT_CLKIN3
#undef PTD18_FXIO_D2_I
#undef PTD18_FXIO_D2_O
#undef PTD18_LCU1_OUT1
#undef PTD19_CAN2_RX
#undef PTD19_DSPI_MSC0_PCS0
#undef PTD19_EMIOS_0_CH0_Z_I
#undef PTD19_EMIOS_0_CH0_Z_O
#undef PTD19_ETPU_A_CH19_I
#undef PTD19_ETPU_A_CH19_O
#undef PTD19_ETPU_B_CH27_I
#undef PTD19_ETPU_B_CH27_O
#undef PTD19_EXT_DATA3
#undef PTD19_FXIO_D3_I
#undef PTD19_FXIO_D3_O
#undef PTD19_LCU1_OUT3
#undef PTD25_EMIOS_0_CH1_Z_I
#undef PTD25_EMIOS_0_CH1_Z_O
#undef PTD25_ETPU_A_CH15_I
#undef PTD25_ETPU_A_CH15_O
#undef PTD25_ETPU_B_CH10_I
#undef PTD25_ETPU_B_CH10_O
#undef PTD25_EVTI_1
#undef PTD29_CAN0_RX
#undef PTD29_LPSPI5_PCS2
#undef PTD30_CAN1_TX
#undef PTD30_ETPU_A_CH16_I
#undef PTD30_ETPU_A_CH16_O
#undef PTD30_LCU0_OUT8
#undef PTD30_LPSPI5_PCS3_I
#undef PTD30_LPSPI5_PCS3_O
#undef PTD31_CAN1_RX
#undef PTD31_ETPU_A_CH8_I
#undef PTD31_ETPU_A_CH8_O
#undef PTD31_FXIO_D6_I
#undef PTD31_FXIO_D6_O
#undef PTD31_LCU0_OUT9
#undef PTE14_CAN4_RX
#undef PTE14_EIRQ13
#undef PTE14_EMAC_PPS1_I
#undef PTE14_EMAC_PPS1_O
#undef PTE14_EMIOS_0_CH19_Z_I
#undef PTE14_EMIOS_0_CH19_Z_O
#undef PTE14_FXIO_D7_I
#undef PTE14_FXIO_D7_O
#undef PTE14_LPUART1_TX_I
#undef PTE14_LPUART1_TX_O
#undef PTE19_EMIOS_0_CH22_Z_I
#undef PTE19_EMIOS_0_CH22_Z_O
#undef PTE19_ETPU_A_CH9_I
#undef PTE19_ETPU_A_CH9_O
#undef PTE20_EMIOS_0_CH2_Z_I
#undef PTE20_EMIOS_0_CH2_Z_O
#undef PTE20_ETPU_B_CH3_I
#undef PTE20_ETPU_B_CH3_O
#undef PTE21_ETPU_B_CH6_I
#undef PTE21_ETPU_B_CH6_O
#undef PTE21_EXTWAKE
#undef PTE21_LPSPI4_SIN_I
#undef PTE21_LPSPI4_SIN_O
#undef PTE27_EMIOS_0_CH4_Z_I
#undef PTE27_EMIOS_0_CH4_Z_O
#undef PTE27_ETPU_A_CH20_I
#undef PTE27_ETPU_A_CH20_O
#undef PTE27_ETPU_B_CH28_I
#undef PTE27_ETPU_B_CH28_O
#undef PTE28_CAN3_TX
#undef PTE28_ETPU_A_CH21_I
#undef PTE28_ETPU_A_CH21_O
#undef PTE28_ETPU_B_CH29_I
#undef PTE28_ETPU_B_CH29_O
#undef PTE28_LPI2C0_SDAS_I
#undef PTE28_LPI2C0_SDAS_O
#undef PTE29_CAN3_RX
#undef PTE29_EMIOS_0_CH5_Z_I
#undef PTE29_EMIOS_0_CH5_Z_O
#undef PTE29_ETPU_B_CH7_I
#undef PTE29_ETPU_B_CH7_O
#undef PTE30_CAN4_TX
#undef PTE30_ETPU_B_CH10_I
#undef PTE30_ETPU_B_CH10_O
#undef PTE30_LPCMP1_OUT
#undef PTE31_CAN4_RX
#undef PTE31_EMIOS_0_CH6_Z_I
#undef PTE31_EMIOS_0_CH6_Z_O
#undef PTE31_ETPU_A_CH31_I
#undef PTE31_ETPU_A_CH31_O
#undef PTE31_ETPU_B_CH11_I
#undef PTE31_ETPU_B_CH11_O
#undef PTE31_LPCMP1_RRT
#undef PTF0_EIRQ0
#undef PTF0_EMIOS_0_CH7_Z_I
#undef PTF0_EMIOS_0_CH7_Z_O
#undef PTF0_ETPU_A_CH30_I
#undef PTF0_ETPU_A_CH30_O
#undef PTF0_ETPU_B_CH12_I
#undef PTF0_ETPU_B_CH12_O
#undef PTF0_LPSPI2_SCK_I
#undef PTF0_LPSPI2_SCK_O
#undef PTF0_LPUART1_TX_I
#undef PTF0_LPUART1_TX_O
#undef PTF0_SWG_EXT_REF_CLK
#undef PTF10_ADC0_MA1
#undef PTF10_EIRQ18
#undef PTF10_EMIOS_0_CH18_Z_I
#undef PTF10_EMIOS_0_CH18_Z_O
#undef PTF10_ETPU_B_CH24_I
#undef PTF10_ETPU_B_CH24_O
#undef PTF11_ADC0_MA2
#undef PTF11_EIRQ19
#undef PTF11_EMIOS_0_CH19_Z_I
#undef PTF11_EMIOS_0_CH19_Z_O
#undef PTF11_ETPU_B_CH25_I
#undef PTF11_ETPU_B_CH25_O
#undef PTF11_HSE_TAMPER_EXTIN0
#undef PTF12_ADC0_MA0
#undef PTF12_EIRQ20
#undef PTF12_EMIOS_0_CH20_Z_I
#undef PTF12_EMIOS_0_CH20_Z_O
#undef PTF12_ETPU_B_CH26_I
#undef PTF12_ETPU_B_CH26_O
#undef PTF12_LPSPI3_SIN_I
#undef PTF12_LPSPI3_SIN_O
#undef PTF12_LPUART2_TX_I
#undef PTF12_LPUART2_TX_O
#undef PTF13_ADC0_MA1
#undef PTF13_EIRQ21
#undef PTF13_EMIOS_0_CH21_Z_I
#undef PTF13_EMIOS_0_CH21_Z_O
#undef PTF13_ETPU_B_CH27_I
#undef PTF13_ETPU_B_CH27_O
#undef PTF13_LPSPI3_SCK_I
#undef PTF13_LPSPI3_SCK_O
#undef PTF13_LPUART2_RX
#undef PTF14_CAN0_TX
#undef PTF14_CAN1_TX
#undef PTF14_DSPI_MSC0_PCS0
#undef PTF14_EIRQ22
#undef PTF14_EMIOS_0_CH17_Z_I
#undef PTF14_EMIOS_0_CH17_Z_O
#undef PTF14_ETPU_A_CH28_I
#undef PTF14_ETPU_A_CH28_O
#undef PTF14_ETPU_B_CH18_I
#undef PTF14_ETPU_B_CH18_O
#undef PTF14_EXT_CLKIN0
#undef PTF14_FCCU_ERR0
#undef PTF14_FCCU_ERR_IN0
#undef PTF14_FXIO_D3_I
#undef PTF14_FXIO_D3_O
#undef PTF14_LCU0_OUT4
#undef PTF14_LPCMP0_OUT
#undef PTF15_CAN1_RX
#undef PTF15_DSPI_MSC0_PCS1
#undef PTF15_EIRQ23
#undef PTF15_EMIOS_0_CH22_Z_I
#undef PTF15_EMIOS_0_CH22_Z_O
#undef PTF15_ETPU_A_CH30_I
#undef PTF15_ETPU_A_CH30_O
#undef PTF15_ETPU_B_CH1_I
#undef PTF15_ETPU_B_CH1_O
#undef PTF15_ETPU_B_CH20_I
#undef PTF15_ETPU_B_CH20_O
#undef PTF15_FCCU_ERR1
#undef PTF15_FCCU_ERR_IN1
#undef PTF15_LCU0_OUT6
#undef PTF15_LPCMP0_RRT
#undef PTF15_LPSPI3_SOUT_I
#undef PTF15_LPSPI3_SOUT_O
#undef PTF16_ADC1_MA0
#undef PTF16_DSPI_MSC0_PCS0
#undef PTF16_ETPU_A_CH31_I
#undef PTF16_ETPU_A_CH31_O
#undef PTF16_ETPU_B_CH21_I
#undef PTF16_ETPU_B_CH21_O
#undef PTF16_ETPU_B_CH2_I
#undef PTF16_ETPU_B_CH2_O
#undef PTF16_EXT_DATA0
#undef PTF16_LCU0_OUT7
#undef PTF16_LPSPI3_PCS0_I
#undef PTF16_LPSPI3_PCS0_O
#undef PTF17_ADC1_MA1
#undef PTF17_ETPU_B_CH22_I
#undef PTF17_ETPU_B_CH22_O
#undef PTF17_EXT_DATA1
#undef PTF18_ADC1_MA2
#undef PTF18_DSPI_MSC0_PCS1
#undef PTF18_ETPU_A_CH18_I
#undef PTF18_ETPU_A_CH18_O
#undef PTF18_ETPU_B_CH26_I
#undef PTF18_ETPU_B_CH26_O
#undef PTF18_EXT_DATA2
#undef PTF18_LCU1_OUT2
#undef PTF18_LPSPI3_PCS1_I
#undef PTF18_LPSPI3_PCS1_O
#undef PTF18_LPUART3_TX_I
#undef PTF18_LPUART3_TX_O
#undef PTF19_ADC0_MA2
#undef PTF19_EMIOS_0_CH5_Z_I
#undef PTF19_EMIOS_0_CH5_Z_O
#undef PTF19_ETPU_B_CH23_I
#undef PTF19_ETPU_B_CH23_O
#undef PTF19_HSE_TAMPER_LOOP_OUT0
#undef PTF19_LPSPI3_PCS2_I
#undef PTF19_LPSPI3_PCS2_O
#undef PTF19_LPUART3_RX
#undef PTF1_EIRQ1
#undef PTF1_EMIOS_0_CH16_Z_I
#undef PTF1_EMIOS_0_CH16_Z_O
#undef PTF1_ETPU_A_CH29_I
#undef PTF1_ETPU_A_CH29_O
#undef PTF1_ETPU_B_CH17_I
#undef PTF1_ETPU_B_CH17_O
#undef PTF1_LPSPI2_SIN_I
#undef PTF1_LPSPI2_SIN_O
#undef PTF1_LPUART1_RX
#undef PTF20_CAN0_TX
#undef PTF20_DSPI_MSC0_SIN
#undef PTF20_EMIOS_0_CH13_Z_I
#undef PTF20_EMIOS_0_CH13_Z_O
#undef PTF20_ETPU_A_CH29_I
#undef PTF20_ETPU_A_CH29_O
#undef PTF20_ETPU_B_CH0_I
#undef PTF20_ETPU_B_CH0_O
#undef PTF20_ETPU_B_CH19_I
#undef PTF20_ETPU_B_CH19_O
#undef PTF20_ETPU_B_TCRCLK
#undef PTF20_EXT_CLKIN1
#undef PTF20_FXIO_D4_I
#undef PTF20_FXIO_D4_O
#undef PTF20_LCU0_OUT5
#undef PTF20_LPI2C0_SCL_I
#undef PTF20_LPI2C0_SCL_O
#undef PTF20_LPSPI3_PCS3_I
#undef PTF20_LPSPI3_PCS3_O
#undef PTF20_LPUART0_TX_I
#undef PTF20_LPUART0_TX_O
#undef PTF21_CAN0_RX
#undef PTF21_DSPI_MSC0_SOUT
#undef PTF21_EMIOS_0_CH14_Z_I
#undef PTF21_EMIOS_0_CH14_Z_O
#undef PTF21_ETPU_A_CH14_I
#undef PTF21_ETPU_A_CH14_O
#undef PTF21_ETPU_B_CH24_I
#undef PTF21_ETPU_B_CH24_O
#undef PTF21_EXT_CLKIN2
#undef PTF21_FXIO_D5_I
#undef PTF21_FXIO_D5_O
#undef PTF21_LCU1_OUT0
#undef PTF21_LPI2C0_SDA_I
#undef PTF21_LPI2C0_SDA_O
#undef PTF21_LPSPI1_PCS0_I
#undef PTF21_LPSPI1_PCS0_O
#undef PTF21_LPUART0_RX
#undef PTF24_EMIOS_0_CH8_Z_I
#undef PTF24_EMIOS_0_CH8_Z_O
#undef PTF24_EVTI_0
#undef PTF24_LPUART1_RX
#undef PTF25_CAN2_TX
#undef PTF25_DSPI_MSC0_PCS0
#undef PTF25_EMIOS_0_CH9_Z_I
#undef PTF25_EMIOS_0_CH9_Z_O
#undef PTF25_ETPU_B_CH0_I
#undef PTF25_ETPU_B_CH0_O
#undef PTF25_ETPU_B_TCRCLK
#undef PTF25_EVTO_0
#undef PTF25_FXIO_D6_I
#undef PTF25_FXIO_D6_O
#undef PTF25_LPSPI2_PCS2_I
#undef PTF25_LPSPI2_PCS2_O
#undef PTF25_LPSPI4_PCS0_I
#undef PTF25_LPSPI4_PCS0_O
#undef PTF26_CAN2_RX
#undef PTF26_EMIOS_0_CH10_Z_I
#undef PTF26_EMIOS_0_CH10_Z_O
#undef PTF26_ETPU_B_CH2_I
#undef PTF26_ETPU_B_CH2_O
#undef PTF26_LPSPI2_PCS3_I
#undef PTF26_LPSPI2_PCS3_O
#undef PTF26_LPSPI4_PCS1_I
#undef PTF26_LPSPI4_PCS1_O
#undef PTF26_LPUART_MSC0_RX
#undef PTF27_DSPI_MSC0_PCS0
#undef PTF27_EMIOS_0_CH11_Z_I
#undef PTF27_EMIOS_0_CH11_Z_O
#undef PTF27_ETPU_B_CH30_I
#undef PTF27_ETPU_B_CH30_O
#undef PTF27_LPSPI4_PCS2_I
#undef PTF27_LPSPI4_PCS2_O
#undef PTF27_LPUART3_TX_I
#undef PTF27_LPUART3_TX_O
#undef PTF28_FXIO_D7_I
#undef PTF28_FXIO_D7_O
#undef PTF28_LPSPI0_PCS0_I
#undef PTF28_LPSPI0_PCS0_O
#undef PTF28_LPSPI4_PCS3_I
#undef PTF28_LPSPI4_PCS3_O
#undef PTF28_LPUART3_RX
#undef PTF28_TRACE_ETM_D5
#undef PTF29_ADC1_MA0
#undef PTF29_CAN3_TX
#undef PTF29_EMIOS_0_CH13_Z_I
#undef PTF29_EMIOS_0_CH13_Z_O
#undef PTF29_ETPU_A_CH0_I
#undef PTF29_ETPU_A_CH0_O
#undef PTF29_ETPU_A_CH21_I
#undef PTF29_ETPU_A_CH21_O
#undef PTF29_ETPU_A_TCRCLK
#undef PTF29_ETPU_B_CH29_I
#undef PTF29_ETPU_B_CH29_O
#undef PTF29_FXIO_D8_I
#undef PTF29_FXIO_D8_O
#undef PTF29_LCU1_OUT5
#undef PTF29_LPI2C0_HREQ
#undef PTF29_LPI2C1_SCL_I
#undef PTF29_LPI2C1_SCL_O
#undef PTF29_LPSPI3_PCS1_I
#undef PTF29_LPSPI3_PCS1_O
#undef PTF2_EIRQ2
#undef PTF2_EMIOS_0_CH23_Z_I
#undef PTF2_EMIOS_0_CH23_Z_O
#undef PTF2_ETPU_B_CH11_I
#undef PTF2_ETPU_B_CH11_O
#undef PTF2_LPSPI2_SOUT_I
#undef PTF2_LPSPI2_SOUT_O
#undef PTF2_LPUART2_TX_I
#undef PTF2_LPUART2_TX_O
#undef PTF30_ADC1_MA1
#undef PTF30_CAN3_RX
#undef PTF30_EMIOS_0_CH14_Z_I
#undef PTF30_EMIOS_0_CH14_Z_O
#undef PTF30_ETPU_B_CH31_I
#undef PTF30_ETPU_B_CH31_O
#undef PTF3_EIRQ3
#undef PTF3_EMIOS_0_CH0_Z_I
#undef PTF3_EMIOS_0_CH0_Z_O
#undef PTF3_ETPU_A_CH28_I
#undef PTF3_ETPU_A_CH28_O
#undef PTF3_LPSPI2_PCS0_I
#undef PTF3_LPSPI2_PCS0_O
#undef PTF3_LPUART2_RX
#undef PTF4_CAN5_TX
#undef PTF4_EIRQ4
#undef PTF4_EMIOS_0_CH1_Z_I
#undef PTF4_EMIOS_0_CH1_Z_O
#undef PTF4_ETPU_B_CH12_I
#undef PTF4_ETPU_B_CH12_O
#undef PTF4_FXIO_D0_I
#undef PTF4_FXIO_D0_O
#undef PTF5_CAN5_RX
#undef PTF5_EIRQ5
#undef PTF5_EMIOS_0_CH2_Z_I
#undef PTF5_EMIOS_0_CH2_Z_O
#undef PTF5_ETPU_A_CH27_I
#undef PTF5_ETPU_A_CH27_O
#undef PTF7_EIRQ7
#undef PTF7_ETPU_B_CH17_I
#undef PTF7_ETPU_B_CH17_O
#undef PTF7_FXIO_D1_I
#undef PTF7_FXIO_D1_O
#undef PTF7_LPI2C1_SCL_I
#undef PTF7_LPI2C1_SCL_O
#undef PTF8_CAN2_TX
#undef PTF8_EIRQ16
#undef PTF8_EMIOS_0_CH4_Z_I
#undef PTF8_EMIOS_0_CH4_Z_O
#undef PTF8_ETPU_B_CH22_I
#undef PTF8_ETPU_B_CH22_O
#undef PTF8_FXIO_D2_I
#undef PTF8_FXIO_D2_O
#undef PTF8_LPI2C1_SDA_I
#undef PTF8_LPI2C1_SDA_O
#undef PTF9_ADC0_MA0
#undef PTF9_EIRQ17
#undef PTF9_EMIOS_0_CH5_Z_I
#undef PTF9_EMIOS_0_CH5_Z_O
#undef PTF9_ETPU_B_CH23_I
#undef PTF9_ETPU_B_CH23_O
#undef PTG0_EIRQ8
#undef PTG0_EMIOS_0_CH6_Z_I
#undef PTG0_EMIOS_0_CH6_Z_O
#undef PTG0_ETPU_A_CH8_I
#undef PTG0_ETPU_A_CH8_O
#undef PTG10_EIRQ26
#undef PTG10_EMIOS_0_CH7_Z_I
#undef PTG10_EMIOS_0_CH7_Z_O
#undef PTG10_ETPU_A_CH15_I
#undef PTG10_ETPU_A_CH15_O
#undef PTG11_EIRQ27
#undef PTG11_EMIOS_0_CH16_Z_I
#undef PTG11_EMIOS_0_CH16_Z_O
#undef PTG11_ETPU_A_CH16_I
#undef PTG11_ETPU_A_CH16_O
#undef PTG12_EIRQ28
#undef PTG12_EMIOS_0_CH18_Z_I
#undef PTG12_EMIOS_0_CH18_Z_O
#undef PTG12_ETPU_A_CH26_I
#undef PTG12_ETPU_A_CH26_O
#undef PTG12_EVTO_1
#undef PTG12_LPSPI4_PCS3_I
#undef PTG12_LPSPI4_PCS3_O
#undef PTG13_CAN5_TX
#undef PTG13_EIRQ29
#undef PTG13_EMIOS_0_CH19_Z_I
#undef PTG13_EMIOS_0_CH19_Z_O
#undef PTG13_ETPU_A_CH20_I
#undef PTG13_ETPU_A_CH20_O
#undef PTG13_ETPU_B_CH28_I
#undef PTG13_ETPU_B_CH28_O
#undef PTG13_FXIO_D13_I
#undef PTG13_FXIO_D13_O
#undef PTG13_LCU1_OUT4
#undef PTG13_LPI2C0_SDA_I
#undef PTG13_LPI2C0_SDA_O
#undef PTG14_CAN5_RX
#undef PTG14_EIRQ30
#undef PTG14_ETPU_A_CH25_I
#undef PTG14_ETPU_A_CH25_O
#undef PTG15_EIRQ31
#undef PTG15_FXIO_D14_I
#undef PTG15_FXIO_D14_O
#undef PTG15_TRACE_ETM_D1
#undef PTG16_FXIO_D15_I
#undef PTG16_FXIO_D15_O
#undef PTG16_TRACE_ETM_D2
#undef PTG17_FXIO_D16_I
#undef PTG17_FXIO_D16_O
#undef PTG17_TRACE_ETM_D4
#undef PTG18_FXIO_D17_I
#undef PTG18_FXIO_D17_O
#undef PTG18_TRACE_ETM_D6
#undef PTG19_FXIO_D18_I
#undef PTG19_FXIO_D18_O
#undef PTG19_TRACE_ETM_D7
#undef PTG1_EIRQ9
#undef PTG1_EMIOS_0_CH17_Z_I
#undef PTG1_EMIOS_0_CH17_Z_O
#undef PTG1_ETPU_A_CH13_I
#undef PTG1_ETPU_A_CH13_O
#undef PTG20_CAN0_TX
#undef PTG20_FXIO_D19_I
#undef PTG20_FXIO_D19_O
#undef PTG20_TRACE_ETM_D8
#undef PTG21_CAN0_RX
#undef PTG21_FXIO_D20_I
#undef PTG21_FXIO_D20_O
#undef PTG21_TRACE_ETM_D9
#undef PTG22_FXIO_D21
#undef PTG22_TRACE_ETM_D10_O
#undef PTG23_FXIO_D22
#undef PTG23_TRACE_ETM_D11_O
#undef PTG24_FXIO_D23
#undef PTG24_TRACE_ETM_D12_O
#undef PTG25_FXIO_D24
#undef PTG25_TRACE_ETM_D13_O
#undef PTG26_CAN1_TX_O
#undef PTG26_FXIO_D25
#undef PTG26_TRACE_ETM_D14_O
#undef PTG27_CAN1_RX_I
#undef PTG27_FXIO_D26
#undef PTG27_TRACE_ETM_D15_O
#undef PTG2_EIRQ10
#undef PTG2_ETPU_A_CH1_I
#undef PTG2_ETPU_A_CH1_O
#undef PTG2_ETPU_A_CH22_I
#undef PTG2_ETPU_A_CH22_O
#undef PTG2_ETPU_B_CH30_I
#undef PTG2_ETPU_B_CH30_O
#undef PTG2_EVTI_0
#undef PTG2_LCU1_OUT6
#undef PTG3_EIRQ11
#undef PTG3_EMIOS_0_CH19_Z_I
#undef PTG3_EMIOS_0_CH19_Z_O
#undef PTG3_ETPU_A_CH23_I
#undef PTG3_ETPU_A_CH23_O
#undef PTG3_ETPU_A_CH2_I
#undef PTG3_ETPU_A_CH2_O
#undef PTG3_ETPU_B_CH31_I
#undef PTG3_ETPU_B_CH31_O
#undef PTG3_EVTO_0
#undef PTG3_LCU1_OUT7
#undef PTG4_EIRQ12
#undef PTG4_EMIOS_0_CH20_Z_I
#undef PTG4_EMIOS_0_CH20_Z_O
#undef PTG4_ETPU_A_CH26_I
#undef PTG4_ETPU_A_CH26_O
#undef PTG4_ETPU_B_CH15_I
#undef PTG4_ETPU_B_CH15_O
#undef PTG4_LCU0_OUT2
#undef PTG5_EIRQ13
#undef PTG5_EMIOS_0_CH21_Z_I
#undef PTG5_EMIOS_0_CH21_Z_O
#undef PTG5_ETPU_A_CH27_I
#undef PTG5_ETPU_A_CH27_O
#undef PTG5_ETPU_B_CH16_I
#undef PTG5_ETPU_B_CH16_O
#undef PTG5_LCU0_OUT3
#undef PTG6_EIRQ14
#undef PTG6_FXIO_D10_I
#undef PTG6_FXIO_D10_O
#undef PTG6_TRACE_ETM_CLKOUT
#undef PTG7_EIRQ15
#undef PTG7_EMIOS_0_CH23_Z_I
#undef PTG7_EMIOS_0_CH23_Z_O
#undef PTG7_FXIO_D11_I
#undef PTG7_FXIO_D11_O
#undef PTG7_TRACE_ETM_D0
#undef PTG8_CAN4_TX
#undef PTG8_EIRQ24
#undef PTG8_EMIOS_0_CH22_Z_I
#undef PTG8_EMIOS_0_CH22_Z_O
#undef PTG8_ETPU_A_CH25_I
#undef PTG8_ETPU_A_CH25_O
#undef PTG8_ETPU_B_CH14_I
#undef PTG8_ETPU_B_CH14_O
#undef PTG8_FXIO_D12_I
#undef PTG8_FXIO_D12_O
#undef PTG8_LCU0_OUT1
#undef PTG8_LPI2C0_SCL_I
#undef PTG8_LPI2C0_SCL_O
#undef PTG9_CAN4_RX
#undef PTG9_EIRQ25
#undef PTG9_EMIOS_0_CH23_Z_I
#undef PTG9_EMIOS_0_CH23_Z_O
#undef PTG9_ETPU_A_CH24_I
#undef PTG9_ETPU_A_CH24_O
#undef PTH10_EIRQ26_I
#undef PTH10_FXIO_D26
#undef PTH10_LPUART3_TX
#undef PTH10_TRACE_ETM_D13_O
#undef PTH11_EIRQ27_I
#undef PTH11_FXIO_D27
#undef PTH11_LPUART3_RX_I
#undef PTH11_TRACE_ETM_D14_O
#undef PTH12_EIRQ28_I
#undef PTH12_FXIO_D28
#undef PTH12_TRACE_ETM_D15_O
#undef PTH7_EIRQ23_I
#undef PTH7_FXIO_D23
#undef PTH7_LPUART0_RX_I
#undef PTH7_TRACE_ETM_D10_O
#undef PTH8_EIRQ24_I
#undef PTH8_FXIO_D24
#undef PTH8_LPUART2_TX
#undef PTH8_TRACE_ETM_D11_O
#undef PTH9_EIRQ25_I
#undef PTH9_FXIO_D25
#undef PTH9_LPUART2_RX_I
#undef PTH9_TRACE_ETM_D12_O

/* Signals specific to this part */
#define PTA28_CAN0_RX                           NXP_SIUL2_PINMUX(0, 0, 28, 0, 0, 4)
#define PTA28_EIRQ6                             NXP_SIUL2_PINMUX(0, 0, 28, 0, 22, 2)
#define PTA28_EMAC_MII_RMII_MDC                 NXP_SIUL2_PINMUX(0, 0, 28, 9, 0, 0)
#define PTA28_EMIOS_0_CH11_Z_I                  NXP_SIUL2_PINMUX(0, 0, 28, 0, 59, 5)
#define PTA28_EMIOS_0_CH11_Z_O                  NXP_SIUL2_PINMUX(0, 0, 28, 8, 0, 0)
#define PTA28_LPSPI1_SCK_I                      NXP_SIUL2_PINMUX(0, 0, 28, 0, 238, 4)
#define PTA28_LPSPI1_SCK_O                      NXP_SIUL2_PINMUX(0, 0, 28, 3, 0, 0)
#define PTA28_LPUART0_RX                        NXP_SIUL2_PINMUX(0, 0, 28, 0, 187, 4)
#define PTE12_CAN5_TX                           NXP_SIUL2_PINMUX(0, 0, 140, 2, 0, 0)
#define PTE12_EIRQ11                            NXP_SIUL2_PINMUX(0, 0, 140, 0, 27, 4)
#define PTE12_EMAC_PPS3_I                       NXP_SIUL2_PINMUX(0, 0, 140, 0, 147, 3)
#define PTE12_EMAC_PPS3_O                       NXP_SIUL2_PINMUX(0, 0, 140, 5, 0, 0)
#define PTE12_FXIO_D7_I                         NXP_SIUL2_PINMUX(0, 0, 140, 0, 159, 9)
#define PTE12_FXIO_D7_O                         NXP_SIUL2_PINMUX(0, 0, 140, 7, 0, 0)
#define PTE12_FXIO_D8_I                         NXP_SIUL2_PINMUX(0, 0, 140, 0, 160, 1)
#define PTE12_FXIO_D8_O                         NXP_SIUL2_PINMUX(0, 0, 140, 6, 0, 0)
#define PTE12_LPUART2_TX_I                      NXP_SIUL2_PINMUX(0, 0, 140, 0, 365, 4)
#define PTE12_LPUART2_TX_O                      NXP_SIUL2_PINMUX(0, 0, 140, 3, 0, 0)
#define PTE12_QUADSPI_INTA                      NXP_SIUL2_PINMUX(0, 0, 140, 0, 437, 4)

#endif /* _ZEPHYR_DTS_BINDING_S32K396_176LQFP_EP_WRAPPER_ */
